


<?php
//	Входные данные:
//	- php-файл класса html.php;
//	- база данных по объектам (согласно варианту).
//
//	Выходные данные:
//	PHP-файл(ы) для страниц,
//	item.php — описание объекта,
//	index.php  — главная страница.
//
//	Необходимо разработать приложения для вывода данных на страницу. На каждой странице должны присутствовать:
//	1.	заголовок с логотипом
//	2.	меню со списком объектов
//	3.	описание объекта
//	4.	фото
//
//	В классе HTMLPage определены следующие методы:
//	function __construct($title) — создание и инициализация объекта (установка названия страницы).
x//	header() — вывод шапки.
//	footer() — вывод «подвала» с копирайтом.
//	logo() — вывод логотипа сайта.
//	menu() — вывод главного меню сайта.
//	content() — вывод основного содержания веб-страницы.
//	write() — вывод веб-страницы, использующий методы для вывода отдельных элементов веб-страницы.


?>